#  Выведите на печать таблицу умножения

for i in range(1,10):
    for j in range(1,10):
        print(i*j,end="\t")
    print()