# Задача 3

s = input("Введите строку: ")
word1, word2 = s.split()
result = word2 + ' ' + word1
print(result)
