# Задача 7

s = input("Введите строку: ")
print(len(s.split()))
