# Даны два действительных числа х и у. 
# Вычислить их сумму, разность, произведение и частное.

x = float(input("x = "))
y = float(input("y = "))

print (f"x + y = {x+y}")
print (f"x - y = {x-y}")
print (f"x * y = {x*y}")
print (f"x / y = {x/y}")